package Utitlities;

import org.apache.log4j.*;

public class Utilities2j {

	public static Integer level = 0;
	
	 public static void echoBySteps (String toPrint){
		 
		 String lev=level.toString();
		 System.out.println(lev+" : "+toPrint);
		 level++;
	 }
	
	 public static void zerofiedLevel(){
		 level=0;
	 }

}
/*

צלי בקר פרוס – מעולה!
מצרכים:
2 קילו צלי כתף (גוש שלם)
בצל חתוך לקוביות
רסק עגבניות קטן
2 עלי דפנה
כף פפריקה
1/3 כוס פטרוזיליה קצוצה
א. מרק
פלפל שחור טחון
מלח

רוטב:
בצל קצוץ
4 עגבניות קצוצות
רסק עגבניות קטן
כפית פפריקה
כפית סוכר
חצי כוס פטרוזיליה קצוצה
א. מרק
פלפל שחור טחון
מלח


 

אופן ההכנה:
1. לטגן את הבשר מכל הכיוונים עד הזהבה להוציא החוצה. לאותו סיר להוסיף בצל לטגן עד הזהבה רסק, תבלינים, פטרוזיליה להחזיר את הבשר ולמלא מים עד 3/4 גובה. לבשל כ 3 וחצי שעות  להוציא את הבשר ולקרר לילה. (המרק שנותר מיותר אפשר לאכול לחוד ואפשר להוסיף בשלב השני)

2. לפרוס את הבשר עם סכין חדה לפרוסות דקות בערך 2 – 3 ס"מ.

3. לטגן את הבצל להוסיף את העגבניות, רסק, סוכר כפית פפריקה לתבל מל"פ וא. מרק כוס מים (פחות אם מוסיפים את הנוזלים מהחלק הראשון) ופטרוזיליה להרתיח ולבשל כשתי דקות להוסיף את פרוסות הבשר, להוסיף בין כוס ל 2 כוסות מים שיכסו את הבשר ולבשל כחצי שעה.  לבדוק טעמים.


*/